Create Pandas Series

In [26]:
#pip install pandas

In [27]:
import pandas as pd

In [28]:
a=pd.Series([1,2,3,4,5])

In [29]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [30]:
a[2]

3

In [31]:
type(a)

pandas.core.series.Series

In [32]:
b=pd.Series(['a','b','c'])

In [33]:
b

0    a
1    b
2    c
dtype: object

In [34]:
c=pd.date_range(start='01-01-2018', end='23-5-2018')

In [35]:
c

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2018-05-14', '2018-05-15', '2018-05-16', '2018-05-17',
               '2018-05-18', '2018-05-19', '2018-05-20', '2018-05-21',
               '2018-05-22', '2018-05-23'],
              dtype='datetime64[ns]', length=143, freq='D')

In [36]:
type(c)

pandas.core.indexes.datetimes.DatetimeIndex

Pandas Dataframe

In [37]:
import numpy as np

In [53]:
temp=np.random.randint(low=20,high=100,size=[20,])
name=np.random.choice(['Abhay','Teclov',"Geekshub",'Ankit'],20)
random=np.random.choice([10,11,13,12,14],20)

In [56]:
a=list(zip(temp,name,random))

In [57]:
a

[(68, 'Ankit', 11),
 (66, 'Geekshub', 11),
 (66, 'Teclov', 13),
 (40, 'Abhay', 14),
 (30, 'Teclov', 10),
 (61, 'Teclov', 12),
 (82, 'Geekshub', 10),
 (82, 'Geekshub', 11),
 (98, 'Abhay', 14),
 (71, 'Geekshub', 13),
 (53, 'Teclov', 14),
 (91, 'Teclov', 14),
 (79, 'Abhay', 12),
 (91, 'Ankit', 12),
 (84, 'Geekshub', 10),
 (28, 'Abhay', 10),
 (93, 'Geekshub', 10),
 (38, 'Ankit', 14),
 (96, 'Ankit', 10),
 (94, 'Teclov', 11)]

In [58]:
df=pd.DataFrame(data=a,columns=['temp','name','random'])

In [59]:
df

    temp      name  random
0     68     Ankit      11
1     66  Geekshub      11
2     66    Teclov      13
3     40     Abhay      14
4     30    Teclov      10
5     61    Teclov      12
6     82  Geekshub      10
7     82  Geekshub      11
8     98     Abhay      14
9     71  Geekshub      13
10    53    Teclov      14
11    91    Teclov      14
12    79     Abhay      12
13    91     Ankit      12
14    84  Geekshub      10
15    28     Abhay      10
16    93  Geekshub      10
17    38     Ankit      14
18    96     Ankit      10
19    94    Teclov      11

In [60]:
type(df)

pandas.core.frame.DataFrame

Create data frame using dictionary

In [61]:
df=pd.DataFrame({'temp':temp,'name':name,'random':random})

In [62]:
df

    temp      name  random
0     68     Ankit      11
1     66  Geekshub      11
2     66    Teclov      13
3     40     Abhay      14
4     30    Teclov      10
5     61    Teclov      12
6     82  Geekshub      10
7     82  Geekshub      11
8     98     Abhay      14
9     71  Geekshub      13
10    53    Teclov      14
11    91    Teclov      14
12    79     Abhay      12
13    91     Ankit      12
14    84  Geekshub      10
15    28     Abhay      10
16    93  Geekshub      10
17    38     Ankit      14
18    96     Ankit      10
19    94    Teclov      11

using head method in dataframe

In [63]:
df.head()

   temp      name  random
0    68     Ankit      11
1    66  Geekshub      11
2    66    Teclov      13
3    40     Abhay      14
4    30    Teclov      10

using tail method in data frame

In [64]:
df.tail()

    temp      name  random
15    28     Abhay      10
16    93  Geekshub      10
17    38     Ankit      14
18    96     Ankit      10
19    94    Teclov      11

check dimension dataframe using in shape method

In [65]:
df.shape

(20, 3)

check columns of  dataframe

In [66]:
df.columns

Index(['temp', 'name', 'random'], dtype='object')

show name of dataframe

In [67]:
df.name

0        Ankit
1     Geekshub
2       Teclov
3        Abhay
4       Teclov
5       Teclov
6     Geekshub
7     Geekshub
8        Abhay
9     Geekshub
10      Teclov
11      Teclov
12       Abhay
13       Ankit
14    Geekshub
15       Abhay
16    Geekshub
17       Ankit
18       Ankit
19      Teclov
Name: name, dtype: object

In [68]:
df['name']

0        Ankit
1     Geekshub
2       Teclov
3        Abhay
4       Teclov
5       Teclov
6     Geekshub
7     Geekshub
8        Abhay
9     Geekshub
10      Teclov
11      Teclov
12       Abhay
13       Ankit
14    Geekshub
15       Abhay
16    Geekshub
17       Ankit
18       Ankit
19      Teclov
Name: name, dtype: object

In [69]:
df['temp'].describe()

count    20.000000
mean     70.550000
std      22.595936
min      28.000000
25%      59.000000
50%      75.000000
75%      91.000000
max      98.000000
Name: temp, dtype: float64

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   temp    20 non-null     int32
 1   name    20 non-null     object
 2   random  20 non-null     int32
dtypes: int32(2), object(1)
memory usage: 448.0+ bytes

In [71]:
df.values

array([[68, 'Ankit', 11],
       [66, 'Geekshub', 11],
       [66, 'Teclov', 13],
       [40, 'Abhay', 14],
       [30, 'Teclov', 10],
       [61, 'Teclov', 12],
       [82, 'Geekshub', 10],
       [82, 'Geekshub', 11],
       [98, 'Abhay', 14],
       [71, 'Geekshub', 13],
       [53, 'Teclov', 14],
       [91, 'Teclov', 14],
       [79, 'Abhay', 12],
       [91, 'Ankit', 12],
       [84, 'Geekshub', 10],
       [28, 'Abhay', 10],
       [93, 'Geekshub', 10],
       [38, 'Ankit', 14],
       [96, 'Ankit', 10],
       [94, 'Teclov', 11]], dtype=object)

In [72]:
df

    temp      name  random
0     68     Ankit      11
1     66  Geekshub      11
2     66    Teclov      13
3     40     Abhay      14
4     30    Teclov      10
5     61    Teclov      12
6     82  Geekshub      10
7     82  Geekshub      11
8     98     Abhay      14
9     71  Geekshub      13
10    53    Teclov      14
11    91    Teclov      14
12    79     Abhay      12
13    91     Ankit      12
14    84  Geekshub      10
15    28     Abhay      10
16    93  Geekshub      10
17    38     Ankit      14
18    96     Ankit      10
19    94    Teclov      11